OpenFOAM_6/tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeaterRadiation/0/topAir/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/topAir";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0.1 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    minX
    {
        type            fixedValue;
        value           $internalField;
    }
    maxX
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    "(min|max)(Y|Z)"
    {
        type            noSlip;
    }
    "topAir_to_.*"
    {
        type            noSlip;
    }
}


// ************************************************************************* //
